rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND ("movies"."id" != ?)  [["director", "Stephen King"], ["id", 3]]
---
  def same_director
    @movie = Movie.find(params[:id])
    @movies = Movie.where(director: @movie.director)